{
  "_name_or_path": "google-bert/bert-base-uncased",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-PASSWORD",
    "2": "I-PASSWORD",
    "3": "B-CITY",
    "4": "I-CITY",
    "5": "B-SEX",
    "6": "I-SEX",
    "7": "B-IPV4",
    "8": "I-IPV4",
    "9": "B-JOBTITLE",
    "10": "I-JOBTITLE",
    "11": "B-COUNTY",
    "12": "I-COUNTY",
    "13": "B-PREFIX",
    "14": "I-PREFIX",
    "15": "B-LASTNAME",
    "16": "I-LASTNAME",
    "17": "B-ACCOUNTNUMBER",
    "18": "I-ACCOUNTNUMBER",
    "19": "B-USERNAME",
    "20": "I-USERNAME",
    "21": "B-PHONENUMBER",
    "22": "I-PHONENUMBER",
    "23": "B-FIRSTNAME",
    "24": "I-FIRSTNAME",
    "25": "B-DATE",
    "26": "I-DATE",
    "27": "B-JOBTYPE",
    "28": "I-JOBTYPE",
    "29": "B-COMPANYNAME",
    "30": "I-COMPANYNAME",
    "31": "B-JOBAREA",
    "32": "I-JOBAREA",
    "33": "B-ZIPCODE",
    "34": "I-ZIPCODE",
    "35": "B-CREDITCARDISSUER",
    "36": "I-CREDITCARDISSUER",
    "37": "B-STATE",
    "38": "I-STATE",
    "39": "B-IPV6",
    "40": "I-IPV6",
    "41": "B-SSN",
    "42": "I-SSN",
    "43": "B-CREDITCARDNUMBER",
    "44": "I-CREDITCARDNUMBER",
    "45": "B-MIDDLENAME",
    "46": "I-MIDDLENAME",
    "47": "B-PHONEIMEI",
    "48": "I-PHONEIMEI",
    "49": "B-DOB",
    "50": "I-DOB",
    "51": "B-SECONDARYADDRESS",
    "52": "I-SECONDARYADDRESS",
    "53": "B-ETHEREUMADDRESS",
    "54": "I-ETHEREUMADDRESS",
    "55": "B-EMAIL",
    "56": "I-EMAIL",
    "57": "B-ORDINALDIRECTION",
    "58": "I-ORDINALDIRECTION",
    "59": "B-CURRENCY",
    "60": "I-CURRENCY",
    "61": "B-BUILDINGNUMBER",
    "62": "I-BUILDINGNUMBER",
    "63": "B-STREET",
    "64": "I-STREET",
    "65": "B-HEIGHT",
    "66": "I-HEIGHT",
    "67": "B-EYECOLOR",
    "68": "I-EYECOLOR",
    "69": "B-NEARBYGPSCOORDINATE",
    "70": "I-NEARBYGPSCOORDINATE",
    "71": "B-URL",
    "72": "I-URL",
    "73": "B-BITCOINADDRESS",
    "74": "I-BITCOINADDRESS",
    "75": "B-IP",
    "76": "I-IP",
    "77": "B-GENDER",
    "78": "I-GENDER",
    "79": "B-AMOUNT",
    "80": "I-AMOUNT",
    "81": "B-AGE",
    "82": "I-AGE",
    "83": "B-MASKEDNUMBER",
    "84": "I-MASKEDNUMBER",
    "85": "B-CREDITCARDCVV",
    "86": "I-CREDITCARDCVV",
    "87": "B-VEHICLEVRM",
    "88": "I-VEHICLEVRM",
    "89": "B-VEHICLEVIN",
    "90": "I-VEHICLEVIN",
    "91": "B-MAC",
    "92": "I-MAC",
    "93": "B-ACCOUNTNAME",
    "94": "I-ACCOUNTNAME",
    "95": "B-USERAGENT",
    "96": "I-USERAGENT",
    "97": "B-LITECOINADDRESS",
    "98": "I-LITECOINADDRESS",
    "99": "B-TIME",
    "100": "I-TIME",
    "101": "B-IBAN",
    "102": "I-IBAN",
    "103": "B-CURRENCYSYMBOL",
    "104": "I-CURRENCYSYMBOL",
    "105": "B-BIC",
    "106": "I-BIC",
    "107": "B-CURRENCYNAME",
    "108": "I-CURRENCYNAME",
    "109": "B-CURRENCYCODE",
    "110": "I-CURRENCYCODE",
    "111": "B-PIN",
    "112": "I-PIN"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-ACCOUNTNAME": 93,
    "B-ACCOUNTNUMBER": 17,
    "B-AGE": 81,
    "B-AMOUNT": 79,
    "B-BIC": 105,
    "B-BITCOINADDRESS": 73,
    "B-BUILDINGNUMBER": 61,
    "B-CITY": 3,
    "B-COMPANYNAME": 29,
    "B-COUNTY": 11,
    "B-CREDITCARDCVV": 85,
    "B-CREDITCARDISSUER": 35,
    "B-CREDITCARDNUMBER": 43,
    "B-CURRENCY": 59,
    "B-CURRENCYCODE": 109,
    "B-CURRENCYNAME": 107,
    "B-CURRENCYSYMBOL": 103,
    "B-DATE": 25,
    "B-DOB": 49,
    "B-EMAIL": 55,
    "B-ETHEREUMADDRESS": 53,
    "B-EYECOLOR": 67,
    "B-FIRSTNAME": 23,
    "B-GENDER": 77,
    "B-HEIGHT": 65,
    "B-IBAN": 101,
    "B-IP": 75,
    "B-IPV4": 7,
    "B-IPV6": 39,
    "B-JOBAREA": 31,
    "B-JOBTITLE": 9,
    "B-JOBTYPE": 27,
    "B-LASTNAME": 15,
    "B-LITECOINADDRESS": 97,
    "B-MAC": 91,
    "B-MASKEDNUMBER": 83,
    "B-MIDDLENAME": 45,
    "B-NEARBYGPSCOORDINATE": 69,
    "B-ORDINALDIRECTION": 57,
    "B-PASSWORD": 1,
    "B-PHONEIMEI": 47,
    "B-PHONENUMBER": 21,
    "B-PIN": 111,
    "B-PREFIX": 13,
    "B-SECONDARYADDRESS": 51,
    "B-SEX": 5,
    "B-SSN": 41,
    "B-STATE": 37,
    "B-STREET": 63,
    "B-TIME": 99,
    "B-URL": 71,
    "B-USERAGENT": 95,
    "B-USERNAME": 19,
    "B-VEHICLEVIN": 89,
    "B-VEHICLEVRM": 87,
    "B-ZIPCODE": 33,
    "I-ACCOUNTNAME": 94,
    "I-ACCOUNTNUMBER": 18,
    "I-AGE": 82,
    "I-AMOUNT": 80,
    "I-BIC": 106,
    "I-BITCOINADDRESS": 74,
    "I-BUILDINGNUMBER": 62,
    "I-CITY": 4,
    "I-COMPANYNAME": 30,
    "I-COUNTY": 12,
    "I-CREDITCARDCVV": 86,
    "I-CREDITCARDISSUER": 36,
    "I-CREDITCARDNUMBER": 44,
    "I-CURRENCY": 60,
    "I-CURRENCYCODE": 110,
    "I-CURRENCYNAME": 108,
    "I-CURRENCYSYMBOL": 104,
    "I-DATE": 26,
    "I-DOB": 50,
    "I-EMAIL": 56,
    "I-ETHEREUMADDRESS": 54,
    "I-EYECOLOR": 68,
    "I-FIRSTNAME": 24,
    "I-GENDER": 78,
    "I-HEIGHT": 66,
    "I-IBAN": 102,
    "I-IP": 76,
    "I-IPV4": 8,
    "I-IPV6": 40,
    "I-JOBAREA": 32,
    "I-JOBTITLE": 10,
    "I-JOBTYPE": 28,
    "I-LASTNAME": 16,
    "I-LITECOINADDRESS": 98,
    "I-MAC": 92,
    "I-MASKEDNUMBER": 84,
    "I-MIDDLENAME": 46,
    "I-NEARBYGPSCOORDINATE": 70,
    "I-ORDINALDIRECTION": 58,
    "I-PASSWORD": 2,
    "I-PHONEIMEI": 48,
    "I-PHONENUMBER": 22,
    "I-PIN": 112,
    "I-PREFIX": 14,
    "I-SECONDARYADDRESS": 52,
    "I-SEX": 6,
    "I-SSN": 42,
    "I-STATE": 38,
    "I-STREET": 64,
    "I-TIME": 100,
    "I-URL": 72,
    "I-USERAGENT": 96,
    "I-USERNAME": 20,
    "I-VEHICLEVIN": 90,
    "I-VEHICLEVRM": 88,
    "I-ZIPCODE": 34,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.41.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
