{
  "_name_or_path": "./cv_models/shipout/ner_microsoft/codebert-base_1",
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-CONFIG",
    "1": "B-ID",
    "2": "B-MAC",
    "3": "B-NET",
    "4": "B-PATH",
    "5": "B-URL",
    "6": "B-USER",
    "7": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-CONFIG": 0,
    "B-ID": 1,
    "B-MAC": 2,
    "B-NET": 3,
    "B-PATH": 4,
    "B-URL": 5,
    "B-USER": 6,
    "O": 7
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.46.3",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
